/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_bot.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bdomansk <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/13 17:41:40 by bdomansk          #+#    #+#             */
/*   Updated: 2019/02/13 17:41:41 by bdomansk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corewar.h"

void	check_bot(t_vm *info, int *i)
{
	if (info->error_reason)
		put_manual(info);//просто для проверки, на самом деле не нужно
	//нужно проверить имя и сам файл
	(*i)++;
}
